Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: A “start a decode session” command, however, has no natural response, so software handshaking provides an ACK/NAK response.
it_it: Un comando "avvia una sessione di decodifica", tuttavia, non ha una risposta naturale, quindi l'handshake software fornisce una risposta ACK/NAK.

source: ACK/NAK Disabled and Decode Data of Any Type
it_it: ACK/NAK Disabilitati e Decodifica Dati di Qualsiasi Tipo

source: ACK/NAK Enabled and Packeted Data
it_it: ACK/NAK Abilitato e Dati Pacchettizzati

source: ACK/NAK Enabled and Unpacketed ASCII Data
it_it: ACK/NAK Abilitato e Dati ASCII non Pacchettizzati

source: ACK/NAK handshaking may be enabled (default) or disabled.
it_it: L'handshake ACK/NAK può essere abilitato (il default) o disabilitato.

source: About This Guide
it_it: A Proposito di Questa Guida

source: Above this velocity CoolStep becomes disabled.
it_it: Al di sopra di questa velocità CoolStep viene disabilitato.

source: Acknowledges host demand to transmit.
it_it: Riceve la richiesta di trasmissione dell'host.

source: Acknowledgments are vital for maintaining synchronization.
it_it: Gli acknowledgment sono fondamentali per mantenere la sincronizzazione.

source: Activates Illumination.
it_it: Attiva l'Illuminazione.

source: Activates LED output.
it_it: Attiva l'uscita LED.

source: Activates aim pattern.
it_it: Attiva l'aim pattern.

source: Active edges on the STEP input can be rising edges or both rising and falling edges as controlled by another mode bit (dedge).
it_it: I fronti attivi sull'ingresso STEP possono essere fronti di salita o entrambi i fronti di salita e discesa, come controllato da un altro bit di modalità (dedge).

source: Actively drive VCC_IO to a low level to ensure that it falls below the lower reset threshold.
it_it: Portare attivamente VCC_IO a un livello basso per garantire che scenda al di sotto della soglia di reset inferiore.

source: Actuates the vibration feedback.
it_it: Attiva il feedback di vibrazione.

source: Adapt to the lower limit of the velocity range where StallGuard2 gives a stable result.
it_it: Adattarsi al limite inferiore dell'intervallo di velocità in cui StallGuard2 fornisce un risultato stabile.

source: Adapt to the velocity range where StallGuard2 gives a stable result.
it_it: Adattarsi all'intervallo di velocità in cui StallGuard2 fornisce un risultato stabile.

source: Additionally, maximum application velocity can be increased up to the actually reachable motor velocity.
it_it: Inoltre, la velocità massima dell'applicazione può essere aumentata fino alla velocità effettivamente raggiungibile del motore.

source: After sending all characters in the message, the host must change the state of the HOST RTS line from active to inactive.
it_it: Dopo aver inviato tutti i caratteri del messaggio, l'host deve modificare lo stato della linea HOST RTS da attiva a inattiva.

source: After setting up SGT and the ramp generator registers, start a motion into the direction of the hard stop and activate the stop on stall function (set sg_stop in SW_MODE).
it_it: Dopo aver impostato SGT e i registri del generatore di rampa, avviare un movimento nella direzione dell'arresto brusco e attivare la funzione di arresto in caso di stallo (impostare sg_stop in SW_MODE).

source: After setting up new motion parameters in order to prevent the motor from restarting right away, StallGuard can be disabled, or the motor can be reenabled by reading RAMP_STAT.
it_it: Dopo aver impostato nuovi parametri di movimento per impedire il riavvio immediato del motore, è possibile disabilitare StallGuard oppure riabilitare il motore leggendo RAMP_STAT.

source: After that we close the current settings window.
it_it: Dopodiché chiudiamo la finestra delle impostazioni correnti.

source: After the step loss, the motor will vibrate and show a higher SG_RESULT reading.
it_it: Dopo la perdita di passo, il motore vibrerà e mostrerà una lettura SG_RESULT più alta.

source: All SPI inputs as well as the ENN input are internally filtered to avoid triggering on pulses shorter than 20ns.
it_it: Tutti gli ingressi SPI, così come l'ingresso ENN, sono filtrati internamente per evitare l'attivazione su impulsi inferiori a 20 ns.

source: All communications between the host and the decoder are exchanged in the form of packets.
it_it: Tutte le comunicazioni tra l'host e il decoder vengono scambiate sotto forma di pacchetti.

source: All data are right aligned.
it_it: Tutti i dati sono allineati a destra.

source: All motion parameters can be changed on the fly.
it_it: Tutti i parametri di movimento possono essere modificati al volo.

source: All pins with suffix CFG0 to CFG6 have a special meaning in this mode.
it_it: Tutti i pin con suffisso da CFG0 a CFG6 hanno un significato speciale in questa modalità.

source: Allowable Decoder Responses
it_it: Risposte Consentite del Decoder

source: Allowable Host Responses
it_it: Risposte Consentite dell'Host

source: Also controls additional functions like switching to fullstepping.
it_it: Controlla anche funzioni aggiuntive come il passaggio al fullstepping.

source: Also, motor resonance may disturb the measurement.
it_it: Inoltre, la risonanza del motore può disturbare la misurazione.

source: Always
it_it: Sempre

source: Always set to zero
it_it: Sempre impostato a zero

source: An additional application note is available concerning parameterization of the chopper control.
it_it: È disponibile un'ulteriore nota applicativa relativa alla parametrizzazione del controllo del chopper.

source: An external crystal-stabilized clock should be used for applications that demand the highest performance.
it_it: Per le applicazioni che richiedono le massime prestazioni, è consigliabile utilizzare un clock esterno stabilizzato al quarzo.

source: An internal table translates the counter value into the sine and cosine values which control the motor current for microstepping.
it_it: Una tabella interna traduce il valore del contatore nei valori di seno e coseno che controllano la corrente del motore per il microstepping.

source: An unsolicited ACK or NAK is an unexpected message, and is ignored since the decoder can not interpret the message.
it_it: Un ACK o NAK non sollecitato è un messaggio inaspettato e viene ignorato poiché il decoder non è in grado di interpretarlo.

source: An upper limit can be specified by THIGH.
it_it: Un limite superiore può essere specificato tramite THIGH.

source: An upper threshold is provided by the VHIGH setting.
it_it: Una soglia superiore è fornita dall'impostazione VHIGH.

source: And press enter.
it_it: E premiamo Invio.

source: And we will set it to a value as an example equal to 9.
it_it: E la imposteremo a un valore, ad esempio, pari a 9.

source: Appendix A Transaction Examples
it_it: Appendice A Esempi di Transazioni

source: Appendix B Mandatory Parameter
it_it: Appendice B Parametro Obbligatorio

source: Application works as fast as possible
it_it: L'applicazione funziona alla massima velocità possibile

source: Apply Mechanical Load with a 2 nd Motor
it_it: Applicazione del carico meccanico con un 2 o motore

source: Apply a slowly increasing mechanical load to the motor.
it_it: Applicare un carico meccanico al motore in lento aumento.

source: Apply slowly increasing mechanical load to the motor.
it_it: Applicare al motore un carico meccanico gradualmente crescente.

source: Applying Mechanical Load (manually) with Wheel
it_it: Applicazione del Carico Meccanico (Manuale) con Rotella

source: As StallGuard needs a certain velocity to work (as set by TCOOLTHRS), make sure that the start point is far enough away from the hard stop to provide the distance required for the acceleration phase.
it_it: Poiché StallGuard necessita di una certa velocità per funzionare (impostata da TCOOLTHRS), assicurarsi che il punto di partenza sia sufficientemente lontano dall'fine-corsa da fornire la distanza necessaria per la fase di accelerazione.

source: As acceleration and decelerations normally shall be quick, they will require the full motor current, while they have only a small contribution to overall power consumption due to their short duration.
it_it: Poiché normalmente le accelerazioni e le decelerazioni sono rapide, richiederanno l'intera corrente del motore, mentre a causa della loro breve durata contribuiscono solo in minima parte al consumo energetico complessivo.

source: As an example, we set it to 25003.
it_it: Ad esempio, la impostiamo a 25003.

source: As an example, we set it to 50081.
it_it: Ad esempio, la impostiamo a 50081.

source: As the StallGuard value depends on parameters like velocity and motor characteristics (Back-EMF) more than one set of parameters should be defined in applications with different operating points.
it_it: Poiché il valore di StallGuard dipende da parametri come la velocità e le caratteristiche del motore (Back-EMF), è necessario definire più di un set di parametri nelle applicazioni con punti operativi diversi.

source: As the motor is loaded the StallGuard value goes down until it reaches the bottom of the hysteresis.
it_it: Man mano che il motore viene caricato, il valore StallGuard diminuisce fino a raggiungere il minimo dell'isteresi.

source: As the motor voltage decreases, the PWM_SCALE value increases.
it_it: Al diminuire della tensione del motore, il valore PWM_SCALE aumenta.

source: As the supply voltage of the motor is increasing over time, the PWM_SCALE value slowly decreases.
it_it: Al crescere della tensione di alimentazione del motore nel tempo, il valore PWM_SCALE diminuisce lentamente.

source: As this is the time in-between step pulses, a smaller value means a higher velocity.
it_it: Poiché questo è il tempo tra gli impulsi di passo, un valore inferiore indica una velocità maggiore.

source: At Resonance, one can see the detection of dynamic load due to the resonance.
it_it: In Risonanza, si può osservare il rilevamento del carico dinamico dovuto alla risonanza.

source: At high velocity, the motor driver cannot bring the full current into the motor anymore, and the motor does not take much more energy than it can consume.
it_it: Ad alta velocità, il driver del motore non riesce più a fornire tutta la corrente al motore, e il motore non assorbe molta più energia di quanta ne possa consumare.

source: At low speed, the Back-EMF is too low for measurement.
it_it: A bassa velocità, la forza controelettromotrice è troppo bassa per la misurazione.

source: At maximum motor load, the value goes to zero or near to zero.
it_it: Al massimo carico del motore, il valore scende a zero o quasi.

source: At standstill and very low velocities, resistive losses are the main factor for the balance of energy in the motor, because mechanical power is zero or near to zero.
it_it: A velocità statica e molto basse, le perdite resistive sono il fattore principale per il bilanciamento dell'energia nel motore, poiché la potenza meccanica è nulla o prossima allo zero.

source: At the end of transmission, the decoder waits for a CMD_ACK or CMD_NAK.
it_it: Al termine della trasmissione, il decoder attende un CMD_ACK o un CMD_NAK.

source: At the same time, monitor the SG_RESULT value at this load, e.g. some value within the range 0 to 100.
it_it: Allo stesso tempo, monitorare il valore di SG_RESULT a questo carico, ad esempio un valore compreso tra 0 e 100.

source: At this point the current increases based on the SEUP value.
it_it: A questo punto, la corrente aumenta in base al valore SEUP.

source: Author
it_it: Autore

source: Be careful when applying mechanical load manually.
it_it: Prestare attenzione quando si applica manualmente il carico meccanico.

source: Because CoolStep is not able to measure the motor load in standstill and at very low RPM, a lower velocity threshold is provided in the ramp generator.
it_it: Poiché CoolStep non è in grado di misurare il carico del motore da fermo e a regimi molto bassi, nel generatore di rampa viene fornita una soglia di velocità inferiore.

source: Because a stepper motor application needs to work with a torque reserve of 30% to 50%, even a constant-load application allows significant energy savings because CoolStep automatically enables torque reserve when required.
it_it: Poiché un'applicazione con motore passo-passo deve funzionare con una riserva di coppia dal 30% al 50%, anche un'applicazione a carico costante consente un notevole risparmio energetico, poiché CoolStep attiva automaticamente la riserva di coppia quando necessario.

source: Because of this operation, the StallGuard4 value does not have the same level of dependence on the motor voltage as the StallGuard2 value does.
it_it: A causa di questa operazione, il valore di StallGuard4 non ha lo stesso livello di dipendenza dalla tensione del motore del valore di StallGuard2.

source: Before CoolStep can be used, StallGuard2 needs to be adequately parameterized.
it_it: Prima di poter utilizzare CoolStep, StallGuard2 deve essere adeguatamente parametrizzato.

source: Before tuning CoolStep, first tune the StallGuard2 threshold level SGT, which affects the range of the load measurement value SG_RESULT.
it_it: Prima di ottimizzare CoolStep, ottimizzare il livello di soglia di StallGuard2 SGT, che influenza l'intervallo del valore di misurazione del carico SG_RESULT.

source: Below this threshold the normal current setting via IRUN respectively IHOLD is valid.
it_it: Al di sotto di questa soglia è valida la normale impostazione della corrente tramite IRUN rispettivamente IHOLD.

source: Below this velocity CoolStep becomes disabled.
it_it: Al di sotto di questa velocità CoolStep viene disabilitato.

source: Benefits of using StealthChop:
it_it: Vantaggi dell'utilizzo di StealthChop:

source: Bit transfer is synchronous to the bus clock SCK, with the node latching the data from SDI on the rising edge of SCK and driving data to SDO following the falling edge.
it_it: Il trasferimento dei bit è sincrono con il clock del bus SCK, con il nodo che aggancia i dati da SDI sul fronte di salita di SCK e li indirizza a SDO dopo il fronte di discesa.

source: Bit1 of the status byte in the message header is set to one for all packets except the last to indicate another packet is to follow.
it_it: Il bit 1 del byte di stato nell'intestazione del messaggio è impostato su uno per tutti i pacchetti tranne l'ultimo, per indicare che un altro pacchetto seguirà.

source: Bits 4 – 7
it_it: Bit 4 – 7

source: Both fixed stepper motors need to be driven with the same current at the same microstep position.
it_it: Entrambi i motori passo-passo fissi devono essere azionati con la stessa corrente nella stessa posizione di micropasso.

source: Both stepper motors first should be mounted on the base plate, with a freewheeling mechanical coupling.
it_it: Entrambi i motori passo-passo devono essere montati sulla piastra di base, con un giunto meccanico a ruota libera.

source: Both stepper motors need to be fixed on a common base plane.
it_it: Entrambi i motori passo-passo devono essere fissati su un piano di base comune.

source: Both stepper motors rotate against each other if the speed is different.
it_it: Entrambi i motori passo-passo ruotano l'uno contro l'altro se la velocità è diversa.

source: Both thresholds can be set as a result of the StallGuard2 tuning process.
it_it: Entrambe le soglie possono essere impostate come risultato del processo di ottimizzazione di StallGuard2.

source: Both, the information available at DIAG0 and DIAG1 can be selected as well as the type of output (low active open drain – default setting, or high active push-pull).
it_it: È possibile selezionare entrambe le informazioni disponibili su DIAG0 e DIAG1, nonché il tipo di uscita (drenaggio aperto attivo basso – impostazione predefinita o push-pull attivo alto).

source: Braking a motor manually can cause injury and is on your own risk!
it_it: Frenare manualmente un motore può causare lesioni ed è a proprio rischio e pericolo!

source: By doing so, this technology reduces the motor energy consumption by up to 90% and reduces yield generation.
it_it: In questo modo, questa tecnologia riduce il consumo energetico del motore fino al 90% e riduce la generazione di rendimento.

source: By finding the lowest possible reading preceding the stall, you will gain safety margin and avoid wrong stall detections.
it_it: Trovando la lettura più bassa possibile prima dello stallo, si otterrà un margine di sicurezza e si eviteranno rilevamenti di stallo errati.

source: By optimizing the motion velocity in high load situations, this feature further enhances overall system efficiency.
it_it: Ottimizzando la velocità di movimento in situazioni di carico elevato, questa funzionalità migliora ulteriormente l'efficienza complessiva del sistema.

source: CFG pin open (no connection)
it_it: pin CFG aperto (nessuna connessione)

source: CFG pin tied to GND
it_it: pin CFG collegato a GND

source: CFG pin tied to VCC_IO
it_it: pin CFG collegato a VCC_IO

source: CMD_NAK Cancel is a special case of transmission by the host, so is considered a solicited message.
it_it: CMD_NAK Cancel è un caso speciale di trasmissione da parte dell'host, quindi è considerato un messaggio sollecitato.

source: CSN must be low during the whole bus transaction.
it_it: Il CSN deve essere basso durante l'intera transazione bus.

source: CSN – chip select input (active low)
it_it: CSN – ingresso chip select (attivo basso)

source: CTS: Driven by HOST RTS.
it_it: CTS: Pilotato dall'RTS dell'HOST.

source: Change Type (applies to parameters)
it_it: Tipo di Modifica (si applica ai parametri)

source: Chapter 1 Introduction to SSI
it_it: Capitolo 1 Introduzione a SSI

source: Chapter 2 SSI Commands
it_it: Capitolo 2 Comandi SSI

source: Chapter 24 will guide you through the process of correctly setting up all registers.
it_it: Il capitolo 24 guiderà attraverso il processo di impostazione corretta di tutti i registri.

source: Chapter Descriptions
it_it: Descrizione dei Capitoli

source: Check the lowest value of SG_RESULT before the motor stalls.
it_it: Controllare il valore più basso di SG_RESULT prima che il motore vada in stallo.

source: Checksum of message
it_it: Checksum del messaggio

source: Choose SG_HIGH upper limit and calculate SEMAX for SG_HIGH.
it_it: Scegliere il limite superiore di SG_HIGH e calcolare SEMAX per SG_HIGH.

source: Choose SG_LOW lower limit and calculate SEMIN for chosen SG_LOW.
it_it: Scegliere il limite inferiore di SG_LOW e calcolare SEMIN per SG_LOW scelto.

source: Choose current decreasing rate SEDN (start with 32 or 8).
it_it: Scegliere la velocità di decrescita della corrente SEDN (iniziare con 32 o 8).

source: Choose current increasing rate SEUP (start with fast 3 or 2).
it_it: Scegliere la velocità di incremento della corrente SEUP (iniziare con 3 o 2 veloci).

source: Choose scaling ½ or ¼ with SEIMIN (start with ½).
it_it: Scegliere la scala ½ o ¼ con SEIMIN (iniziare con ½).

source: Choose velocity.
it_it: Scegliere la velocità.

source: Choose your nominal phase current (typically as RMS current for motor, peak current for driver).
it_it: Scegliere la corrente di fase nominale (tipicamente come corrente RMS per il motore, corrente di picco per il driver).

source: Choose your supply voltage and nominal phase current (typically as RMS current for motor, peak current for driver).
it_it: Scegliere la tensione di alimentazione e la corrente di fase nominale (tipicamente come corrente RMS per il motore, corrente di picco per il driver).

source: Chopper on-state shows the on-state of both coil choppers (alternating) when working in SpreadCycle or constant off time in order to determine the duty cycle.
it_it: Chopper on-state mostra lo stato attivo di entrambi i chopper a bobina (alternati) quando si lavora in SpreadCycle o in un tempo di spegnimento costante per determinare il ciclo di lavoro.

source: Clear upon read
it_it: Cancella dopo la lettura

source: Commands imager into operational modes.
it_it: Comanda l'imager in modalità operativa.

source: Comment
it_it: Commento

source: Communication between an SPI master and the TMC5130A node always consists of sending one 40-bit command word and receiving one 40-bit status word.
it_it: La comunicazione tra un master SPI e il nodo TMC5130A consiste sempre nell'invio di una parola di comando a 40 bit e nella ricezione di una parola di stato a 40 bit.

source: Configuration of STOCK.2 and Cool step requires just few settings using the TMC5130 evaluation.
it_it: La configurazione di StallGuard2 e Cool Step richiede solo poche impostazioni utilizzando la valutazione TMC5130.

source: Contact information is available at: http://www.zebra.com.
it_it: Le informazioni di contatto sono disponibili all'indirizzo: http://www.zebra.com.

source: Continuation Bit
it_it: Bit di Continuazione

source: Cool step is dynamic motor current control based on stop world values.
it_it: Cool Step è un controllo dinamico della corrente del motore basato sui valori di arresto.

source: CoolStep allows substantial energy savings, especially for motors which see varying loads or operate at a high duty cycle.
it_it: CoolStep consente un notevole risparmio energetico, soprattutto per i motori sottoposti a carichi variabili o che operano con un ciclo di lavoro elevato.

source: CoolStep drives the motor at the optimum current.
it_it: CoolStep aziona il motore alla corrente ottimale.

source: CoolStep is an automatic smart energy optimization for stepper motors based on the motor mechanical load, making them “green”.
it_it: CoolStep è un sistema automatico di ottimizzazione energetica intelligente per motori passo-passo basato sul carico meccanico del motore, che li rende “green”.

source: CoolStep is controlled by several parameters, but two are critical for understanding how it works:
it_it: CoolStep è controllato da diversi parametri, ma due sono fondamentali per comprenderne il funzionamento:

source: CoolStep is enabled above 60RPM in the example.
it_it: Nell'esempio, CoolStep è abilitato sopra i 60 giri/min.

source: CoolStep operates between limits controlled by the current scale parameter IRUN and the seimin bit.
it_it: CoolStep funziona tra i limiti controllati dal parametro di scala corrente IRUN e dal bit seimin.

source: CoolStep uses SG_RESULT to operate the motor near the optimum load angle of +90°.
it_it: CoolStep utilizza SG_RESULT per far funzionare il motore vicino all'angolo di carico ottimale di +90°.

source: CoolStep will continue at this current until either the StallGuard value goes down further, which will cause the current to increase, or the StallGuard value increases, which will cause the current to decrease.
it_it: CoolStep continuerà a questa corrente finché il valore StallGuard non scenderà ulteriormente, il che causerà un aumento della corrente, oppure finché il valore StallGuard non aumenterà, il che causerà una diminuzione della corrente.

source: CoolStep – Load Adaptive Current Control
it_it: CoolStep – Controllo Adattivo della Corrente al Carico

source: Cover
it_it: Copertina

source: Current consumed from VCC_IO is low and therefore it has simple driving requirements.
it_it: La corrente assorbita da VCC_IO è bassa e quindi i requisiti di pilotaggio sono semplici.

source: DIAG0 also becomes driven low upon a reset condition.
it_it: Anche DIAG0 diventa basso in caso di condizione di reset.

source: Data comprising the image.
it_it: Dati che compongono l'immagine.

source: Data comprising the video.
it_it: Dati che compongono il video.

source: Data...
it_it: Dati....

source: Data....
it_it: Dati....

source: Date
it_it: Data
